Revit 2024 API
IEntryPoint Interface
The interface supporting Document and Application level entry point classes for macros.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public interface IEntryPoint
Visual Basic
Public Interface IEntryPoint
Visual C++
public interface class IEntryPoint
See Also
IEntryPoint Members
Autodesk.Revit.DB.Macros Namespace